zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_100_tqfp.h
/* PORT 10 (GPIO) */
#define P10_0_PORT                      GPIO_PRT10
#define P10_0_PIN                       0u
#define P10_0_NUM                       0u
#define P10_0_AMUXSEGMENT               AMUXBUS_MSC0
#define P10_1_PORT                      GPIO_PRT10
#define P10_1_PIN                       1u
#define P10_1_NUM                       1u
#define P10_1_AMUXSEGMENT               AMUXBUS_MSC0
#define P10_2_PORT                      GPIO_PRT10
#define P10_2_PIN                       2u
#define P10_2_NUM                       2u
#define P10_2_AMUXSEGMENT               AMUXBUS_MSC0
#define P10_3_PORT                      GPIO_PRT10
#define P10_3_PIN                       3u
#define P10_3_NUM                       3u
#define P10_3_AMUXSEGMENT               AMUXBUS_MSC0
#define P10_4_PORT                      GPIO_PRT10
#define P10_4_PIN                       4u
#define P10_4_NUM                       4u
#define P10_4_AMUXSEGMENT               AMUXBUS_MSC0
#define P10_5_PORT                      GPIO_PRT10
#define P10_5_PIN                       5u
#define P10_5_NUM                       5u
#define P10_5_AMUXSEGMENT               AMUXBUS_MSC0

/* PORT 11 (GPIO) */
#define P11_0_PORT                      GPIO_PRT11
#define P11_0_PIN                       0u
#define P11_0_NUM                       0u
#define P11_0_AMUXSEGMENT               AMUXBUS_MSC0
#define P11_1_PORT                      GPIO_PRT11
#define P11_1_PIN                       1u
#define P11_1_NUM                       1u
#define P11_1_AMUXSEGMENT               AMUXBUS_MSC0
#define P11_2_PORT                      GPIO_PRT11
#define P11_2_PIN                       2u
#define P11_2_NUM                       2u
#define P11_2_AMUXSEGMENT               AMUXBUS_MSC0
#define P11_3_PORT                      GPIO_PRT11
#define P11_3_PIN                       3u
#define P11_3_NUM                       3u
#define P11_3_AMUXSEGMENT               AMUXBUS_MSC0
#define P11_4_PORT                      GPIO_PRT11
#define P11_4_PIN                       4u
#define P11_4_NUM                       4u
#define P11_4_AMUXSEGMENT               AMUXBUS_MSC0
#define P11_5_PORT                      GPIO_PRT11
#define P11_5_PIN                       5u
#define P11_5_NUM                       5u
#define P11_5_AMUXSEGMENT               AMUXBUS_MSC0

/* PORT 12 (GPIO) */
#define P12_0_PORT                      GPIO_PRT12
#define P12_0_PIN                       0u
#define P12_0_NUM                       0u
#define P12_0_AMUXSEGMENT               AMUXBUS_MSC0
#define P12_1_PORT                      GPIO_PRT12
#define P12_1_PIN                       1u
#define P12_1_NUM                       1u
#define P12_1_AMUXSEGMENT               AMUXBUS_MSC0

/* Analog Connections */
#define EXCO_ECO_IN_PORT                0u
#define EXCO_ECO_IN_PIN                 6u
#define EXCO_ECO_OUT_PORT               0u
#define EXCO_ECO_OUT_PIN                7u
#define LPCOMP_IN_N0_PORT               0u
#define LPCOMP_IN_N0_PIN                1u
#define LPCOMP_IN_N1_PORT               0u
#define LPCOMP_IN_N1_PIN                3u
#define LPCOMP_IN_P0_PORT               0u
#define LPCOMP_IN_P0_PIN                0u
#define LPCOMP_IN_P1_PORT               0u
#define LPCOMP_IN_P1_PIN                2u
#define MSC0_CMOD1PADD_PORT             4u
#define MSC0_CMOD1PADD_PIN              2u
#define MSC0_CMOD1PADS_PORT             4u
#define MSC0_CMOD1PADS_PIN              2u
#define MSC0_CMOD2PADD_PORT             4u
#define MSC0_CMOD2PADD_PIN              3u
#define MSC0_CMOD2PADS_PORT             4u
#define MSC0_CMOD2PADS_PIN              3u
#define MSC0_CMOD3PADD_PORT             4u
#define MSC0_CMOD3PADD_PIN              0u
#define MSC0_CMOD3PADS_PORT             4u
#define MSC0_CMOD3PADS_PIN              0u
#define MSC0_CMOD4PADD_PORT             4u
#define MSC0_CMOD4PADD_PIN              1u
#define MSC0_CMOD4PADS_PORT             4u
#define MSC0_CMOD4PADS_PIN              1u
#define MSC0_S_PAD0_PORT                6u
#define MSC0_S_PAD0_PIN                 5u
#define MSC0_S_PAD1_PORT                3u
#define MSC0_S_PAD1_PIN                 0u
#define MSC0_S_PAD10_PORT               11u
#define MSC0_S_PAD10_PIN                3u
#define MSC0_S_PAD11_PORT               11u
#define MSC0_S_PAD11_PIN                4u
#define MSC0_S_PAD12_PORT               4u
#define MSC0_S_PAD12_PIN                4u
#define MSC0_S_PAD13_PORT               4u
#define MSC0_S_PAD13_PIN                5u
#define MSC0_S_PAD14_PORT               4u
#define MSC0_S_PAD14_PIN                6u
#define MSC0_S_PAD15_PORT               4u
#define MSC0_S_PAD15_PIN                7u
#define MSC0_S_PAD2_PORT                3u
#define MSC0_S_PAD2_PIN                 1u
#define MSC0_S_PAD3_PORT                3u
#define MSC0_S_PAD3_PIN                 4u
#define MSC0_S_PAD4_PORT                3u
#define MSC0_S_PAD4_PIN                 5u
#define MSC0_S_PAD5_PORT                3u
#define MSC0_S_PAD5_PIN                 6u
#define MSC0_S_PAD6_PORT                3u
#define MSC0_S_PAD6_PIN                 7u
#define MSC0_S_PAD7_PORT                11u
#define MSC0_S_PAD7_PIN                 0u
#define MSC0_S_PAD8_PORT                11u
#define MSC0_S_PAD8_PIN                 1u
#define MSC0_S_PAD9_PORT                11u
#define MSC0_S_PAD9_PIN                 2u
#define MSC1_CMOD1PADD_PORT             5u
#define MSC1_CMOD1PADD_PIN              1u
#define MSC1_CMOD1PADS_PORT             5u
#define MSC1_CMOD1PADS_PIN              1u
#define MSC1_CMOD2PADD_PORT             5u
#define MSC1_CMOD2PADD_PIN              2u
#define MSC1_CMOD2PADS_PORT             5u
#define MSC1_CMOD2PADS_PIN              2u
#define MSC1_CMOD3PADD_PORT             7u
#define MSC1_CMOD3PADD_PIN              0u
#define MSC1_CMOD3PADS_PORT             7u
#define MSC1_CMOD3PADS_PIN              0u
#define MSC1_CMOD4PADD_PORT             7u
#define MSC1_CMOD4PADD_PIN              1u
#define MSC1_CMOD4PADS_PORT             7u
#define MSC1_CMOD4PADS_PIN              1u
#define MSC1_S_PAD0_PORT                5u
#define MSC1_S_PAD0_PIN                 6u
#define MSC1_S_PAD1_PORT                5u
#define MSC1_S_PAD1_PIN                 7u
#define MSC1_S_PAD10_PORT               9u
#define MSC1_S_PAD10_PIN                2u
#define MSC1_S_PAD11_PORT               9u
#define MSC1_S_PAD11_PIN                3u
#define MSC1_S_PAD12_PORT               5u
#define MSC1_S_PAD12_PIN                0u
#define MSC1_S_PAD13_PORT               5u
#define MSC1_S_PAD13_PIN                3u
#define MSC1_S_PAD14_PORT               5u
#define MSC1_S_PAD14_PIN                4u
#define MSC1_S_PAD15_PORT               5u
#define MSC1_S_PAD15_PIN                5u
#define MSC1_S_PAD2_PORT                7u
#define MSC1_S_PAD2_PIN                 6u
#define MSC1_S_PAD3_PORT                7u
#define MSC1_S_PAD3_PIN                 7u
#define MSC1_S_PAD4_PORT                0u
#define MSC1_S_PAD4_PIN                 0u
#define MSC1_S_PAD5_PORT                0u
#define MSC1_S_PAD5_PIN                 1u
#define MSC1_S_PAD6_PORT                0u
#define MSC1_S_PAD6_PIN                 2u
#define MSC1_S_PAD7_PORT                0u
#define MSC1_S_PAD7_PIN                 3u
#define MSC1_S_PAD8_PORT                9u
#define MSC1_S_PAD8_PIN                 0u
#define MSC1_S_PAD9_PORT                9u
#define MSC1_S_PAD9_PIN                 1u
#define PASS0_CTB0_OA0_OUT_10X_PORT     1u
#define PASS0_CTB0_OA0_OUT_10X_PIN      2u
#define PASS0_CTB0_OA1_OUT_10X_PORT     1u
#define PASS0_CTB0_OA1_OUT_10X_PIN      3u
#define PASS0_CTB0_PADS0_PORT           1u
#define PASS0_CTB0_PADS0_PIN            0u
#define PASS0_CTB0_PADS1_PORT           1u
#define PASS0_CTB0_PADS1_PIN            1u
#define PASS0_CTB0_PADS2_PORT           1u
#define PASS0_CTB0_PADS2_PIN            2u
#define PASS0_CTB0_PADS3_PORT           1u
#define PASS0_CTB0_PADS3_PIN            3u
#define PASS0_CTB0_PADS4_PORT           1u
#define PASS0_CTB0_PADS4_PIN            4u
#define PASS0_CTB0_PADS5_PORT           1u
#define PASS0_CTB0_PADS5_PIN            5u
#define PASS0_CTB0_PADS6_PORT           1u
#define PASS0_CTB0_PADS6_PIN            6u
#define PASS0_CTB0_PADS7_PORT           1u
#define PASS0_CTB0_PADS7_PIN            7u
#define PASS0_SAR_EXT_VREF0_PORT        1u
#define PASS0_SAR_EXT_VREF0_PIN         7u
#define PASS0_SAR_EXT_VREF1_PORT        1u
#define PASS0_SAR_EXT_VREF1_PIN         7u
#define PASS0_SARMUX_PADS0_PORT         2u
#define PASS0_SARMUX_PADS0_PIN          0u
#define PASS0_SARMUX_PADS1_PORT         2u
#define PASS0_SARMUX_PADS1_PIN          1u
#define PASS0_SARMUX_PADS2_PORT         2u
#define PASS0_SARMUX_PADS2_PIN          2u
#define PASS0_SARMUX_PADS3_PORT         2u
#define PASS0_SARMUX_PADS3_PIN          3u
#define PASS0_SARMUX_PADS4_PORT         2u
#define PASS0_SARMUX_PADS4_PIN          4u
#define PASS0_SARMUX_PADS5_PORT         2u
#define PASS0_SARMUX_PADS5_PIN          5u
#define PASS0_SARMUX_PADS6_PORT         2u
#define PASS0_SARMUX_PADS6_PIN          6u
#define PASS0_SARMUX_PADS7_PORT         2u
#define PASS0_SARMUX_PADS7_PIN          7u
#define SRSS_ADFT_POR_PAD_HV_PORT       0u
#define SRSS_ADFT_POR_PAD_HV_PIN        6u
#define WCO_WCO_IN_PORT                 0u
#define WCO_WCO_IN_PIN                  4u
#define WCO_WCO_OUT_PORT                0u
#define WCO_WCO_OUT_PIN                 5u

/* HSIOM Connections */
typedef enum
{
    /* Generic HSIOM connections */
    HSIOM_SEL_GPIO                  =  0,       /* SW controlled GPIO. */
    HSIOM_SEL_GPIO_DSI              =  1,       /* SW controlled 'out', DSI controlled 'oe_n'. */
    HSIOM_SEL_DSI_DSI               =  2,       /* DSI controlled 'out' and 'oe_n'. */
    HSIOM_SEL_DSI_GPIO              =  3,       /* DSI controlled 'out', SW controlled 'oe_n'. */
    HSIOM_SEL_CSD_SENSE             =  4,       /* CSD sense connection (analog mode) */
    HSIOM_SEL_CSD_SHIELD            =  5,       /* CSD shield connection (analog mode) */
    HSIOM_SEL_AMUXA                 =  6,       /* AMUXBUS A connection. */
    HSIOM_SEL_AMUXB                 =  7,       /* AMUXBUS B connection. */
    HSIOM_SEL_ACT_0                 =  8,       /* Chip specific Active source 0 connection. */
    HSIOM_SEL_ACT_1                 =  9,       /* Chip specific Active source 1 connection. */
    HSIOM_SEL_ACT_2                 = 10,       /* Chip specific Active source 2 connection. */
    HSIOM_SEL_ACT_3                 = 11,       /* Chip specific Active source 3 connection. */
    HSIOM_SEL_LCD_COM               = 12,       /* LCD common connection. */
    HSIOM_SEL_LCD_SEG               = 13,       /* LCD segment connection. */
    HSIOM_SEL_DS_0                  = 12,       /* Chip specific DeepSleep source 0 connection. */
    HSIOM_SEL_DS_1                  = 13,       /* Chip specific DeepSleep source 1 connection. */
    HSIOM_SEL_DS_2                  = 14,       /* Chip specific DeepSleep source 2 connection. */
    HSIOM_SEL_DS_3                  = 15,       /* Chip specific DeepSleep source 3 connection. */

    /* P0.0 */
    P0_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_0_MSC1_SENSE                 =  4,       /* msc[1].sense:14 */
    P0_0_MSC1_SHIELD                =  5,       /* msc[1].shield:14 */
    P0_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_0_TCPWM_TR_IN0               =  9,       /* Digital Active - tcpwm.tr_in[0] */
    P0_0_PASS0_DSI_SAR_DATA_VALID   = 10,       /* Digital Active - pass[0].dsi_sar_data_valid */
    P0_0_SCB2_UART_CTS              = 11,       /* Digital Active - scb[2].uart_cts:0 */
    P0_0_LCD_COM0                   = 12,       /* Digital Deep Sleep - lcd.com[0] */
    P0_0_LCD_SEG0                   = 13,       /* Digital Deep Sleep - lcd.seg[0] */
    P0_0_SCB2_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[2].i2c_scl:0 */
    P0_0_SCB0_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[0].spi_select1:0 */

    /* P0.1 */
    P0_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_1_MSC1_SENSE                 =  4,       /* msc[1].sense:15 */
    P0_1_MSC1_SHIELD                =  5,       /* msc[1].shield:15 */
    P0_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_1_TCPWM_TR_IN1               =  9,       /* Digital Active - tcpwm.tr_in[1] */
    P0_1_PASS0_TR_SAR_OUT           = 10,       /* Digital Active - pass[0].tr_sar_out */
    P0_1_SCB2_UART_RTS              = 11,       /* Digital Active - scb[2].uart_rts:0 */
    P0_1_LCD_COM1                   = 12,       /* Digital Deep Sleep - lcd.com[1] */
    P0_1_LCD_SEG1                   = 13,       /* Digital Deep Sleep - lcd.seg[1] */
    P0_1_SCB2_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[2].i2c_sda:0 */
    P0_1_SCB0_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[0].spi_select2:0 */

