zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_100_tqfp.h
    /* P5.6 */
    P5_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_6_MSC1_SENSE                 =  4,       /* msc[1].sense:4 */
    P5_6_MSC1_SHIELD                =  5,       /* msc[1].shield:4 */
    P5_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_6_TCPWM_LINE7                =  8,       /* Digital Active - tcpwm.line[7]:0 */
    P5_6_LCD_COM46                  = 12,       /* Digital Deep Sleep - lcd.com[46] */
    P5_6_LCD_SEG46                  = 13,       /* Digital Deep Sleep - lcd.seg[46] */
    P5_6_SCB4_SPI_SELECT1           = 14,       /* Digital Deep Sleep - scb[4].spi_select1 */
    P5_6_SCB2_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[2].spi_select3:0 */

    /* P5.7 */
    P5_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_7_MSC1_SENSE                 =  4,       /* msc[1].sense:5 */
    P5_7_MSC1_SHIELD                =  5,       /* msc[1].shield:5 */
    P5_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_7_TCPWM_LINE_COMPL7          =  8,       /* Digital Active - tcpwm.line_compl[7]:0 */
    P5_7_LCD_COM47                  = 12,       /* Digital Deep Sleep - lcd.com[47] */
    P5_7_LCD_SEG47                  = 13,       /* Digital Deep Sleep - lcd.seg[47] */
    P5_7_SCB4_SPI_SELECT2           = 14,       /* Digital Deep Sleep - scb[4].spi_select2 */
    P5_7_SCB3_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[3].spi_select1:1 */

    /* P6.0 */
    P6_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_0_MSC0_SENSE                 =  4,       /* msc[0].sense:22 */
    P6_0_MSC0_SHIELD                =  5,       /* msc[0].shield:22 */
    P6_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_0_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:1 */
    P6_0_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:0 */
    P6_0_MSC0_EXT_FRM_START         = 10,       /* Digital Active - msc[0].ext_frm_start:1 */
    P6_0_LCD_COM48                  = 12,       /* Digital Deep Sleep - lcd.com[48] */
    P6_0_LCD_SEG48                  = 13,       /* Digital Deep Sleep - lcd.seg[48] */
    P6_0_SCB3_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[3].i2c_scl:1 */
    P6_0_SCB3_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[3].spi_mosi:0 */

    /* P6.1 */
    P6_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_1_MSC0_SENSE                 =  4,       /* msc[0].sense:23 */
    P6_1_MSC0_SHIELD                =  5,       /* msc[0].shield:23 */
    P6_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_1_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:1 */
    P6_1_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:0 */
    P6_1_MSC0_EXT_SYNC_CLK          = 10,       /* Digital Active - msc[0].ext_sync_clk:1 */
    P6_1_CANFD_TTCAN_RX0            = 11,       /* Digital Active - canfd.ttcan_rx[0]:0 */
    P6_1_LCD_COM49                  = 12,       /* Digital Deep Sleep - lcd.com[49] */
    P6_1_LCD_SEG49                  = 13,       /* Digital Deep Sleep - lcd.seg[49] */
    P6_1_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:1 */
    P6_1_SCB3_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[3].spi_miso:0 */

    /* P6.2 */
    P6_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_2_MSC0_SENSE                 =  4,       /* msc[0].sense:24 */
    P6_2_MSC0_SHIELD                =  5,       /* msc[0].shield:24 */
    P6_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_2_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:0 */
    P6_2_SCB3_UART_CTS              =  9,       /* Digital Active - scb[3].uart_cts:0 */
    P6_2_MSC0_EXT_SYNC              = 10,       /* Digital Active - msc[0].ext_sync:1 */
    P6_2_CANFD_TTCAN_TX0            = 11,       /* Digital Active - canfd.ttcan_tx[0]:0 */
    P6_2_LCD_COM50                  = 12,       /* Digital Deep Sleep - lcd.com[50] */
    P6_2_LCD_SEG50                  = 13,       /* Digital Deep Sleep - lcd.seg[50] */
    P6_2_SCB3_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[3].spi_clk:0 */

    /* P6.3 */
    P6_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_3_MSC0_SENSE                 =  4,       /* msc[0].sense:25 */
    P6_3_MSC0_SHIELD                =  5,       /* msc[0].shield:25 */
    P6_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_3_TCPWM_LINE_COMPL5          =  8,       /* Digital Active - tcpwm.line_compl[5]:0 */
    P6_3_SCB3_UART_RTS              =  9,       /* Digital Active - scb[3].uart_rts:0 */
    P6_3_LCD_COM51                  = 12,       /* Digital Deep Sleep - lcd.com[51] */
    P6_3_LCD_SEG51                  = 13,       /* Digital Deep Sleep - lcd.seg[51] */
    P6_3_SCB3_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[3].spi_select0:0 */

    /* P6.4 */
    P6_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_4_MSC0_SENSE                 =  4,       /* msc[0].sense:26 */
    P6_4_MSC0_SHIELD                =  5,       /* msc[0].shield:26 */
    P6_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_4_TCPWM_LINE6                =  8,       /* Digital Active - tcpwm.line[6]:0 */
    P6_4_LCD_COM52                  = 12,       /* Digital Deep Sleep - lcd.com[52] */
    P6_4_LCD_SEG52                  = 13,       /* Digital Deep Sleep - lcd.seg[52] */
    P6_4_SCB4_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[4].i2c_scl */
    P6_4_SCB3_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[3].spi_select1:0 */

