zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_100_tqfp.h
    /* P6.5 */
    P6_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_5_MSC0_SENSE                 =  4,       /* msc[0].sense:29 */
    P6_5_MSC0_SHIELD                =  5,       /* msc[0].shield:29 */
    P6_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_5_TCPWM_LINE_COMPL6          =  8,       /* Digital Active - tcpwm.line_compl[6]:0 */
    P6_5_LCD_COM53                  = 12,       /* Digital Deep Sleep - lcd.com[53] */
    P6_5_LCD_SEG53                  = 13,       /* Digital Deep Sleep - lcd.seg[53] */
    P6_5_SCB4_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[4].i2c_sda */
    P6_5_SCB3_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[3].spi_select2:0 */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_0_MSC1_SENSE                 =  4,       /* msc[1].sense:6 */
    P7_0_MSC1_SHIELD                =  5,       /* msc[1].shield:6 */
    P7_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_0_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:2 */
    P7_0_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:2 */
    P7_0_LCD_COM54                  = 12,       /* Digital Deep Sleep - lcd.com[54]:0 */
    P7_0_LCD_SEG54                  = 13,       /* Digital Deep Sleep - lcd.seg[54] */
    P7_0_SCB3_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[3].i2c_scl:2 */
    P7_0_SCB3_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[3].spi_mosi:1 */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_1_MSC1_SENSE                 =  4,       /* msc[1].sense:7 */
    P7_1_MSC1_SHIELD                =  5,       /* msc[1].shield:7 */
    P7_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_1_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:2 */
    P7_1_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:2 */
    P7_1_LCD_COM55                  = 12,       /* Digital Deep Sleep - lcd.com[55]:0 */
    P7_1_LCD_SEG55                  = 13,       /* Digital Deep Sleep - lcd.seg[55] */
    P7_1_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:2 */
    P7_1_SCB3_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[3].spi_miso:1 */

    /* P7.2 */
    P7_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_2_MSC1_SENSE                 =  4,       /* msc[1].sense:8 */
    P7_2_MSC1_SHIELD                =  5,       /* msc[1].shield:8 */
    P7_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_2_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:2 */
    P7_2_SCB3_UART_CTS              =  9,       /* Digital Active - scb[3].uart_cts:2 */
    P7_2_LCD_COM56                  = 12,       /* Digital Deep Sleep - lcd.com[56]:0 */
    P7_2_LCD_SEG56                  = 13,       /* Digital Deep Sleep - lcd.seg[56] */
    P7_2_SCB3_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[3].spi_clk:1 */

    /* P7.3 */
    P7_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_3_MSC1_SENSE                 =  4,       /* msc[1].sense:9 */
    P7_3_MSC1_SHIELD                =  5,       /* msc[1].shield:9 */
    P7_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_3_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:2 */
    P7_3_SCB3_UART_RTS              =  9,       /* Digital Active - scb[3].uart_rts:2 */
    P7_3_AUDIOSS_CLK_I2S_IF         = 11,       /* Digital Active - audioss.clk_i2s_if:2 */
    P7_3_AUDIOSS0_CLK_I2S_IF        = 11,       /* Digital Active - audioss[0].clk_i2s_if:2:0 */
    P7_3_LCD_COM57                  = 12,       /* Digital Deep Sleep - lcd.com[57]:0 */
    P7_3_LCD_SEG57                  = 13,       /* Digital Deep Sleep - lcd.seg[57] */
    P7_3_SCB3_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[3].spi_select2:2 */

    /* P7.4 */
    P7_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_4_MSC1_SENSE                 =  4,       /* msc[1].sense:10 */
    P7_4_MSC1_SHIELD                =  5,       /* msc[1].shield:10 */
    P7_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_4_TCPWM_LINE2                =  8,       /* Digital Active - tcpwm.line[2]:2 */
    P7_4_AUDIOSS_TX_SCK             = 11,       /* Digital Active - audioss.tx_sck:2 */
    P7_4_AUDIOSS0_TX_SCK            = 11,       /* Digital Active - audioss[0].tx_sck:2:0 */
    P7_4_LCD_COM58                  = 12,       /* Digital Deep Sleep - lcd.com[58]:0 */
    P7_4_LCD_SEG58                  = 13,       /* Digital Deep Sleep - lcd.seg[58] */
    P7_4_SCB3_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[3].spi_select0:1 */

    /* P7.5 */
    P7_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_5_MSC1_SENSE                 =  4,       /* msc[1].sense:11 */
    P7_5_MSC1_SHIELD                =  5,       /* msc[1].shield:11 */
    P7_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_5_TCPWM_LINE_COMPL2          =  8,       /* Digital Active - tcpwm.line_compl[2]:2 */
    P7_5_AUDIOSS_TX_SDO             = 11,       /* Digital Active - audioss.tx_sdo:2 */
    P7_5_AUDIOSS0_TX_SDO            = 11,       /* Digital Active - audioss[0].tx_sdo:2:0 */
    P7_5_LCD_COM59                  = 12,       /* Digital Deep Sleep - lcd.com[59]:0 */
    P7_5_LCD_SEG59                  = 13,       /* Digital Deep Sleep - lcd.seg[59]:0 */
    P7_5_SCB3_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[3].spi_select1:2 */

    /* P7.6 */
    P7_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_6_MSC1_SENSE                 =  4,       /* msc[1].sense:12 */
    P7_6_MSC1_SHIELD                =  5,       /* msc[1].shield:12 */
    P7_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_6_TCPWM_LINE3                =  8,       /* Digital Active - tcpwm.line[3]:2 */
    P7_6_AUDIOSS_TX_WS              = 11,       /* Digital Active - audioss.tx_ws:2 */
    P7_6_AUDIOSS0_TX_WS             = 11,       /* Digital Active - audioss[0].tx_ws:2:0 */
    P7_6_LCD_COM60                  = 12,       /* Digital Deep Sleep - lcd.com[60]:0 */
    P7_6_LCD_SEG60                  = 13,       /* Digital Deep Sleep - lcd.seg[60]:0 */
    P7_6_SCB3_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[3].spi_select3:1 */

    /* P7.7 */
    P7_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_7_MSC1_SENSE                 =  4,       /* msc[1].sense:13 */
    P7_7_MSC1_SHIELD                =  5,       /* msc[1].shield:13 */
    P7_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_7_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:2 */
    P7_7_LCD_COM61                  = 12,       /* Digital Deep Sleep - lcd.com[61]:0 */
    P7_7_LCD_SEG61                  = 13,       /* Digital Deep Sleep - lcd.seg[61]:0 */

    /* P8.0 */
    P8_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P8_0_MSC1_SENSE                 =  4,       /* msc[1].sense:22 */
    P8_0_MSC1_SHIELD                =  5,       /* msc[1].shield:22 */
    P8_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P8_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P8_0_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:4 */
    P8_0_SCB4_UART_RX               =  9,       /* Digital Active - scb[4].uart_rx:2 */
    P8_0_MSC1_EXT_SYNC              = 10,       /* Digital Active - msc[1].ext_sync:0 */
    P8_0_AUDIOSS_CLK_I2S_IF         = 11,       /* Digital Active - audioss.clk_i2s_if:3 */
    P8_0_AUDIOSS0_CLK_I2S_IF        = 11,       /* Digital Active - audioss[0].clk_i2s_if:3:0 */
    P8_0_LCD_COM0                   = 12,       /* Digital Deep Sleep - lcd.com[0]:1 */
    P8_0_LCD_SEG0                   = 13,       /* Digital Deep Sleep - lcd.seg[0]:1 */
    P8_0_SCB4_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[4].i2c_scl:1 */
    P8_0_SCB3_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[3].spi_mosi:2 */

    /* P8.1 */
    P8_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P8_1_MSC1_SENSE                 =  4,       /* msc[1].sense:23 */
    P8_1_MSC1_SHIELD                =  5,       /* msc[1].shield:23 */
    P8_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P8_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P8_1_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:4 */
    P8_1_SCB4_UART_TX               =  9,       /* Digital Active - scb[4].uart_tx:2 */
    P8_1_MSC1_EXT_SYNC_CLK          = 10,       /* Digital Active - msc[1].ext_sync_clk:0 */
    P8_1_AUDIOSS_TX_SCK             = 11,       /* Digital Active - audioss.tx_sck:3 */
    P8_1_AUDIOSS0_TX_SCK            = 11,       /* Digital Active - audioss[0].tx_sck:3:0 */
    P8_1_LCD_COM1                   = 12,       /* Digital Deep Sleep - lcd.com[1]:1 */
    P8_1_LCD_SEG1                   = 13,       /* Digital Deep Sleep - lcd.seg[1]:1 */
    P8_1_SCB4_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[4].i2c_sda:1 */
    P8_1_SCB3_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[3].spi_miso:2 */

    /* P8.2 */
    P8_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P8_2_MSC1_SENSE                 =  4,       /* msc[1].sense:24 */
    P8_2_MSC1_SHIELD                =  5,       /* msc[1].shield:24 */
    P8_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P8_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P8_2_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:4 */
    P8_2_SCB4_UART_CTS              =  9,       /* Digital Active - scb[4].uart_cts:2 */
    P8_2_MSC1_EXT_FRM_START         = 10,       /* Digital Active - msc[1].ext_frm_start:0 */
    P8_2_AUDIOSS_TX_WS              = 11,       /* Digital Active - audioss.tx_ws:3 */
    P8_2_AUDIOSS0_TX_WS             = 11,       /* Digital Active - audioss[0].tx_ws:3:0 */
    P8_2_LCD_COM2                   = 12,       /* Digital Deep Sleep - lcd.com[2]:1 */
    P8_2_LCD_SEG2                   = 13,       /* Digital Deep Sleep - lcd.seg[2]:1 */
    P8_2_LPCOMP_COMP0               = 14,       /* Digital Deep Sleep - lpcomp.comp[0]:3 */
    P8_2_SCB3_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[3].spi_clk:2 */

