zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_100_tqfp.h
    /* P8.3 */
    P8_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P8_3_MSC1_SENSE                 =  4,       /* msc[1].sense:25 */
    P8_3_MSC1_SHIELD                =  5,       /* msc[1].shield:25 */
    P8_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P8_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P8_3_TCPWM_LINE_COMPL5          =  8,       /* Digital Active - tcpwm.line_compl[5]:4 */
    P8_3_SCB4_UART_RTS              =  9,       /* Digital Active - scb[4].uart_rts:2 */
    P8_3_AUDIOSS_TX_SDO             = 11,       /* Digital Active - audioss.tx_sdo:3 */
    P8_3_AUDIOSS0_TX_SDO            = 11,       /* Digital Active - audioss[0].tx_sdo:3:0 */
    P8_3_LCD_COM3                   = 12,       /* Digital Deep Sleep - lcd.com[3]:1 */
    P8_3_LCD_SEG3                   = 13,       /* Digital Deep Sleep - lcd.seg[3]:1 */
    P8_3_LPCOMP_COMP1               = 14,       /* Digital Deep Sleep - lpcomp.comp[1]:3 */
    P8_3_SCB3_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[3].spi_select0:2 */

    /* P9.0 */
    P9_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P9_0_MSC1_SENSE                 =  4,       /* msc[1].sense:26 */
    P9_0_MSC1_SHIELD                =  5,       /* msc[1].shield:26 */
    P9_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P9_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P9_0_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:4 */
    P9_0_SCB0_UART_RX               =  9,       /* Digital Active - scb[0].uart_rx:2 */
    P9_0_CANFD_TTCAN_RX0            = 11,       /* Digital Active - canfd.ttcan_rx[0]:2 */
    P9_0_LCD_COM8                   = 12,       /* Digital Deep Sleep - lcd.com[8]:1 */
    P9_0_LCD_SEG8                   = 13,       /* Digital Deep Sleep - lcd.seg[8]:1 */
    P9_0_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:2 */
    P9_0_SCB0_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[0].spi_mosi:2 */

    /* P9.1 */
    P9_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P9_1_MSC1_SENSE                 =  4,       /* msc[1].sense:27 */
    P9_1_MSC1_SHIELD                =  5,       /* msc[1].shield:27 */
    P9_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P9_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P9_1_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:3 */
    P9_1_SCB0_UART_TX               =  9,       /* Digital Active - scb[0].uart_tx:2 */
    P9_1_CANFD_TTCAN_TX0            = 11,       /* Digital Active - canfd.ttcan_tx[0]:2 */
    P9_1_LCD_COM9                   = 12,       /* Digital Deep Sleep - lcd.com[9]:1 */
    P9_1_LCD_SEG9                   = 13,       /* Digital Deep Sleep - lcd.seg[9]:1 */
    P9_1_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:2 */
    P9_1_SCB0_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[0].spi_miso:2 */

    /* P9.2 */
    P9_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P9_2_MSC1_SENSE                 =  4,       /* msc[1].sense:28 */
    P9_2_MSC1_SHIELD                =  5,       /* msc[1].shield:28 */
    P9_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P9_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P9_2_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:3 */
    P9_2_SCB0_UART_CTS              =  9,       /* Digital Active - scb[0].uart_cts:2 */
    P9_2_LCD_COM10                  = 12,       /* Digital Deep Sleep - lcd.com[10]:1 */
    P9_2_LCD_SEG10                  = 13,       /* Digital Deep Sleep - lcd.seg[10]:1 */
    P9_2_SCB0_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[0].spi_clk:2 */

    /* P9.3 */
    P9_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P9_3_MSC1_SENSE                 =  4,       /* msc[1].sense:29 */
    P9_3_MSC1_SHIELD                =  5,       /* msc[1].shield:29 */
    P9_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P9_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P9_3_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:3 */
    P9_3_SCB0_UART_RTS              =  9,       /* Digital Active - scb[0].uart_rts:2 */
    P9_3_LCD_COM11                  = 12,       /* Digital Deep Sleep - lcd.com[11]:1 */
    P9_3_LCD_SEG11                  = 13,       /* Digital Deep Sleep - lcd.seg[11]:1 */
    P9_3_SCB0_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[0].spi_select0:2 */

    /* P10.0 */
    P10_0_GPIO                      =  0,       /* SW controlled GPIO. */
    P10_0_MSC0_SENSE                =  4,       /* msc[0].sense:16 */
    P10_0_MSC0_SHIELD               =  5,       /* msc[0].shield:16 */
    P10_0_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P10_0_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P10_0_TCPWM_LINE7               =  8,       /* Digital Active - tcpwm.line[7]:3 */
    P10_0_MSC1_EXT_SYNC             = 10,       /* Digital Active - msc[1].ext_sync:1 */
    P10_0_SCB2_UART_RX              = 11,       /* Digital Active - scb[2].uart_rx:2 */
    P10_0_LCD_COM16                 = 12,       /* Digital Deep Sleep - lcd.com[16]:1 */
    P10_0_LCD_SEG16                 = 13,       /* Digital Deep Sleep - lcd.seg[16]:1 */
    P10_0_SCB2_I2C_SCL              = 14,       /* Digital Deep Sleep - scb[2].i2c_scl:3 */
    P10_0_SCB2_SPI_MOSI             = 15,       /* Digital Deep Sleep - scb[2].spi_mosi:2 */

    /* P10.1 */
    P10_1_GPIO                      =  0,       /* SW controlled GPIO. */
    P10_1_MSC0_SENSE                =  4,       /* msc[0].sense:17 */
    P10_1_MSC0_SHIELD               =  5,       /* msc[0].shield:17 */
    P10_1_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P10_1_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P10_1_TCPWM_LINE_COMPL7         =  8,       /* Digital Active - tcpwm.line_compl[7]:3 */
    P10_1_MSC1_EXT_SYNC_CLK         = 10,       /* Digital Active - msc[1].ext_sync_clk:1 */
    P10_1_SCB2_UART_TX              = 11,       /* Digital Active - scb[2].uart_tx:3 */
    P10_1_LCD_COM17                 = 12,       /* Digital Deep Sleep - lcd.com[17]:1 */
    P10_1_LCD_SEG17                 = 13,       /* Digital Deep Sleep - lcd.seg[17]:1 */
    P10_1_SCB2_I2C_SDA              = 14,       /* Digital Deep Sleep - scb[2].i2c_sda:3 */
    P10_1_SCB2_SPI_MISO             = 15,       /* Digital Deep Sleep - scb[2].spi_miso:2 */

