zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_100_tqfp.h
    /* P10.2 */
    P10_2_GPIO                      =  0,       /* SW controlled GPIO. */
    P10_2_MSC0_SENSE                =  4,       /* msc[0].sense:18 */
    P10_2_MSC0_SHIELD               =  5,       /* msc[0].shield:18 */
    P10_2_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P10_2_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P10_2_TCPWM_LINE2               =  8,       /* Digital Active - tcpwm.line[2]:3 */
    P10_2_MSC1_EXT_FRM_START        = 10,       /* Digital Active - msc[1].ext_frm_start:1 */
    P10_2_SCB2_UART_CTS             = 11,       /* Digital Active - scb[2].uart_cts:2 */
    P10_2_LCD_COM18                 = 12,       /* Digital Deep Sleep - lcd.com[18]:1 */
    P10_2_LCD_SEG18                 = 13,       /* Digital Deep Sleep - lcd.seg[18]:1 */
    P10_2_SCB2_SPI_CLK              = 15,       /* Digital Deep Sleep - scb[2].spi_clk:2 */

    /* P10.3 */
    P10_3_GPIO                      =  0,       /* SW controlled GPIO. */
    P10_3_MSC0_SENSE                =  4,       /* msc[0].sense:19 */
    P10_3_MSC0_SHIELD               =  5,       /* msc[0].shield:19 */
    P10_3_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P10_3_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P10_3_TCPWM_LINE_COMPL2         =  8,       /* Digital Active - tcpwm.line_compl[2]:3 */
    P10_3_MSC0_EXT_SYNC             = 10,       /* Digital Active - msc[0].ext_sync:0 */
    P10_3_SCB2_UART_RTS             = 11,       /* Digital Active - scb[2].uart_rts:2 */
    P10_3_LCD_COM19                 = 12,       /* Digital Deep Sleep - lcd.com[19]:1 */
    P10_3_LCD_SEG19                 = 13,       /* Digital Deep Sleep - lcd.seg[19]:1 */
    P10_3_SCB2_SPI_SELECT0          = 15,       /* Digital Deep Sleep - scb[2].spi_select0:2 */

    /* P10.4 */
    P10_4_GPIO                      =  0,       /* SW controlled GPIO. */
    P10_4_MSC0_SENSE                =  4,       /* msc[0].sense:20 */
    P10_4_MSC0_SHIELD               =  5,       /* msc[0].shield:20 */
    P10_4_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P10_4_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P10_4_TCPWM_LINE3               =  8,       /* Digital Active - tcpwm.line[3]:3 */
    P10_4_MSC0_EXT_SYNC_CLK         = 10,       /* Digital Active - msc[0].ext_sync_clk:0 */
    P10_4_CANFD_TTCAN_RX0           = 11,       /* Digital Active - canfd.ttcan_rx[0]:3 */
    P10_4_LCD_COM20                 = 12,       /* Digital Deep Sleep - lcd.com[20]:1 */
    P10_4_LCD_SEG20                 = 13,       /* Digital Deep Sleep - lcd.seg[20]:1 */
    P10_4_SCB2_SPI_SELECT1          = 15,       /* Digital Deep Sleep - scb[2].spi_select1:1 */

    /* P10.5 */
    P10_5_GPIO                      =  0,       /* SW controlled GPIO. */
    P10_5_MSC0_SENSE                =  4,       /* msc[0].sense:21 */
    P10_5_MSC0_SHIELD               =  5,       /* msc[0].shield:21 */
    P10_5_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P10_5_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P10_5_TCPWM_LINE_COMPL3         =  8,       /* Digital Active - tcpwm.line_compl[3]:3 */
    P10_5_MSC0_EXT_FRM_START        = 10,       /* Digital Active - msc[0].ext_frm_start:0 */
    P10_5_CANFD_TTCAN_TX0           = 11,       /* Digital Active - canfd.ttcan_tx[0]:3 */
    P10_5_LCD_COM21                 = 12,       /* Digital Deep Sleep - lcd.com[21]:1 */
    P10_5_LCD_SEG21                 = 13,       /* Digital Deep Sleep - lcd.seg[21]:1 */
    P10_5_SCB2_SPI_SELECT2          = 15,       /* Digital Deep Sleep - scb[2].spi_select2:1 */

    /* P11.0 */
    P11_0_GPIO                      =  0,       /* SW controlled GPIO. */
    P11_0_MSC0_SENSE                =  4,       /* msc[0].sense:38 */
    P11_0_MSC0_SHIELD               =  5,       /* msc[0].shield:38 */
    P11_0_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P11_0_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P11_0_TCPWM_LINE4               =  8,       /* Digital Active - tcpwm.line[4]:3 */
    P11_0_SCB4_UART_RX              =  9,       /* Digital Active - scb[4].uart_rx:1 */
    P11_0_LCD_COM24                 = 12,       /* Digital Deep Sleep - lcd.com[24]:1 */
    P11_0_LCD_SEG24                 = 13,       /* Digital Deep Sleep - lcd.seg[24]:1 */
    P11_0_SCB4_SPI_MOSI             = 14,       /* Digital Deep Sleep - scb[4].spi_mosi:1 */
    P11_0_SCB1_SPI_MOSI             = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:3 */

    /* P11.1 */
    P11_1_GPIO                      =  0,       /* SW controlled GPIO. */
    P11_1_MSC0_SENSE                =  4,       /* msc[0].sense:39 */
    P11_1_MSC0_SHIELD               =  5,       /* msc[0].shield:39 */
    P11_1_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P11_1_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P11_1_TCPWM_LINE_COMPL4         =  8,       /* Digital Active - tcpwm.line_compl[4]:3 */
    P11_1_SCB4_UART_TX              =  9,       /* Digital Active - scb[4].uart_tx:1 */
    P11_1_LCD_COM25                 = 12,       /* Digital Deep Sleep - lcd.com[25]:1 */
    P11_1_LCD_SEG25                 = 13,       /* Digital Deep Sleep - lcd.seg[25]:1 */
    P11_1_SCB4_SPI_MISO             = 14,       /* Digital Deep Sleep - scb[4].spi_miso:1 */
    P11_1_SCB1_SPI_MISO             = 15,       /* Digital Deep Sleep - scb[1].spi_miso:3 */

    /* P11.2 */
    P11_2_GPIO                      =  0,       /* SW controlled GPIO. */
    P11_2_MSC0_SENSE                =  4,       /* msc[0].sense:40 */
    P11_2_MSC0_SHIELD               =  5,       /* msc[0].shield:40 */
    P11_2_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P11_2_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P11_2_TCPWM_LINE5               =  8,       /* Digital Active - tcpwm.line[5]:3 */
    P11_2_SCB4_UART_CTS             =  9,       /* Digital Active - scb[4].uart_cts:1 */
    P11_2_LCD_COM26                 = 12,       /* Digital Deep Sleep - lcd.com[26]:1 */
    P11_2_LCD_SEG26                 = 13,       /* Digital Deep Sleep - lcd.seg[26]:1 */
    P11_2_SCB4_SPI_CLK              = 14,       /* Digital Deep Sleep - scb[4].spi_clk:1 */
    P11_2_SCB1_SPI_CLK              = 15,       /* Digital Deep Sleep - scb[1].spi_clk:3 */

