zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_100_tqfp.h
    /* P11.3 */
    P11_3_GPIO                      =  0,       /* SW controlled GPIO. */
    P11_3_MSC0_SENSE                =  4,       /* msc[0].sense:41 */
    P11_3_MSC0_SHIELD               =  5,       /* msc[0].shield:41 */
    P11_3_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P11_3_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P11_3_TCPWM_LINE_COMPL5         =  8,       /* Digital Active - tcpwm.line_compl[5]:3 */
    P11_3_SCB4_UART_RTS             =  9,       /* Digital Active - scb[4].uart_rts:1 */
    P11_3_LCD_COM27                 = 12,       /* Digital Deep Sleep - lcd.com[27]:1 */
    P11_3_LCD_SEG27                 = 13,       /* Digital Deep Sleep - lcd.seg[27]:1 */
    P11_3_SCB4_SPI_SELECT0          = 14,       /* Digital Deep Sleep - scb[4].spi_select0:1 */
    P11_3_SCB1_SPI_SELECT0          = 15,       /* Digital Deep Sleep - scb[1].spi_select0:3 */

    /* P11.4 */
    P11_4_GPIO                      =  0,       /* SW controlled GPIO. */
    P11_4_MSC0_SENSE                =  4,       /* msc[0].sense:42 */
    P11_4_MSC0_SHIELD               =  5,       /* msc[0].shield:42 */
    P11_4_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P11_4_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P11_4_TCPWM_LINE6               =  8,       /* Digital Active - tcpwm.line[6]:3 */
    P11_4_LCD_COM28                 = 12,       /* Digital Deep Sleep - lcd.com[28]:1 */
    P11_4_LCD_SEG28                 = 13,       /* Digital Deep Sleep - lcd.seg[28]:1 */
    P11_4_SCB4_SPI_SELECT1          = 14,       /* Digital Deep Sleep - scb[4].spi_select1:1 */
    P11_4_SCB1_SPI_SELECT1          = 15,       /* Digital Deep Sleep - scb[1].spi_select1:2 */

    /* P11.5 */
    P11_5_GPIO                      =  0,       /* SW controlled GPIO. */
    P11_5_MSC0_SENSE                =  4,       /* msc[0].sense:43 */
    P11_5_MSC0_SHIELD               =  5,       /* msc[0].shield:43 */
    P11_5_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P11_5_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P11_5_TCPWM_LINE_COMPL6         =  8,       /* Digital Active - tcpwm.line_compl[6]:3 */
    P11_5_LCD_COM29                 = 12,       /* Digital Deep Sleep - lcd.com[29]:1 */
    P11_5_LCD_SEG29                 = 13,       /* Digital Deep Sleep - lcd.seg[29]:1 */
    P11_5_SCB4_SPI_SELECT2          = 14,       /* Digital Deep Sleep - scb[4].spi_select2:1 */
    P11_5_SCB1_SPI_SELECT2          = 15,       /* Digital Deep Sleep - scb[1].spi_select2:2 */

    /* P12.0 */
    P12_0_GPIO                      =  0,       /* SW controlled GPIO. */
    P12_0_MSC0_SENSE                =  4,       /* msc[0].sense:27 */
    P12_0_MSC0_SHIELD               =  5,       /* msc[0].shield:27 */
    P12_0_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P12_0_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P12_0_TCPWM_LINE7               =  8,       /* Digital Active - tcpwm.line[7]:2 */
    P12_0_LCD_COM62                 = 12,       /* Digital Deep Sleep - lcd.com[62]:0 */
    P12_0_LCD_SEG62                 = 13,       /* Digital Deep Sleep - lcd.seg[62]:0 */
    P12_0_SCB1_I2C_SCL              = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:3 */
    P12_0_SCB3_SPI_SELECT3          = 15,       /* Digital Deep Sleep - scb[3].spi_select3:0 */

    /* P12.1 */
    P12_1_GPIO                      =  0,       /* SW controlled GPIO. */
    P12_1_MSC0_SENSE                =  4,       /* msc[0].sense:28 */
    P12_1_MSC0_SHIELD               =  5,       /* msc[0].shield:28 */
    P12_1_AMUXA                     =  6,       /* AMUXBUS A connection. */
    P12_1_AMUXB                     =  7,       /* AMUXBUS B connection. */
    P12_1_TCPWM_LINE_COMPL7         =  8,       /* Digital Active - tcpwm.line_compl[7]:2 */
    P12_1_LCD_COM63                 = 12,       /* Digital Deep Sleep - lcd.com[63]:0 */
    P12_1_LCD_SEG63                 = 13,       /* Digital Deep Sleep - lcd.seg[63]:0 */
    P12_1_SCB1_I2C_SDA              = 14        /* Digital Deep Sleep - scb[1].i2c_sda:3 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4100SMAX_100_TQFP_H_ */


/* [] END OF FILE */
